; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	infrared0 - mode
	spectrograph1 - mode
	GroundStation2 - direction
	GroundStation4 - direction
	Star1 - direction
	GroundStation3 - direction
	Star0 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Star14 - direction
	Planet15 - direction
	Planet16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star0)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet16)
)
(:goal (and
	(pointing satellite1 Planet8)
	(have_image Phenomenon5 infrared0)
	(have_image Planet6 infrared0)
	(have_image Phenomenon7 spectrograph1)
	(have_image Planet8 spectrograph1)
	(have_image Planet9 spectrograph1)
	(have_image Star10 infrared0)
	(have_image Planet11 infrared0)
	(have_image Planet12 infrared0)
	(have_image Planet13 infrared0)
	(have_image Star14 infrared0)
	(have_image Planet15 infrared0)
	(have_image Planet16 infrared0)
	(have_image Phenomenon17 infrared0)
))

)

; plan
1. (turn_to satellite0 groundstation3 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 14
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 14
3. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 0 of 14
4. (turn_to satellite0 phenomenon7 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon7)
   goals met: 0 of 14
5. (take_image satellite0 phenomenon7 instrument1 spectrograph1)
   added: (have_image phenomenon7 spectrograph1)
   goals met: 1 of 14
6. (turn_to satellite0 phenomenon5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon5)
   goals met: 1 of 14
7. (take_image satellite0 phenomenon5 instrument1 infrared0)
   added: (have_image phenomenon5 infrared0)
   goals met: 2 of 14
8. (turn_to satellite0 phenomenon17 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon17)
   goals met: 2 of 14
9. (take_image satellite0 phenomenon17 instrument1 infrared0)
   added: (have_image phenomenon17 infrared0)
   goals met: 3 of 14
10. (turn_to satellite0 planet11 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet11)
   goals met: 3 of 14
11. (take_image satellite0 planet11 instrument1 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 4 of 14
12. (turn_to satellite0 planet12 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet12)
   goals met: 4 of 14
13. (take_image satellite0 planet12 instrument1 infrared0)
   added: (have_image planet12 infrared0)
   goals met: 5 of 14
14. (turn_to satellite0 planet13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet13)
   goals met: 5 of 14
15. (take_image satellite0 planet13 instrument1 infrared0)
   added: (have_image planet13 infrared0)
   goals met: 6 of 14
16. (turn_to satellite0 planet15 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet15)
   goals met: 6 of 14
17. (take_image satellite0 planet15 instrument1 infrared0)
   added: (have_image planet15 infrared0)
   goals met: 7 of 14
18. (turn_to satellite0 planet16 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet16)
   goals met: 7 of 14
19. (take_image satellite0 planet16 instrument1 infrared0)
   added: (have_image planet16 infrared0)
   goals met: 8 of 14
20. (turn_to satellite0 planet6 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet6)
   goals met: 8 of 14
21. (take_image satellite0 planet6 instrument1 infrared0)
   added: (have_image planet6 infrared0)
   goals met: 9 of 14
22. (turn_to satellite0 planet8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet8)
   goals met: 9 of 14
23. (take_image satellite0 planet8 instrument1 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 10 of 14
24. (turn_to satellite0 planet9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet9)
   goals met: 10 of 14
25. (take_image satellite0 planet9 instrument1 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 11 of 14
26. (turn_to satellite0 star10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star10)
   goals met: 11 of 14
27. (take_image satellite0 star10 instrument1 infrared0)
   added: (have_image star10 infrared0)
   goals met: 12 of 14
28. (turn_to satellite0 star14 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star14)
   goals met: 12 of 14
29. (take_image satellite0 star14 instrument1 infrared0)
   added: (have_image star14 infrared0)
   goals met: 13 of 14
30. (turn_to satellite1 planet8 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet8)
   goals met: 14 of 14
